Repository: 16CentAstrology/sdk
Catalog: src/dotnet/commands/dotnet-publish/xlf/LocalizableStrings.*.xlf
Languages: cs, ru, zh_hant

# AppDescription
source: Publisher for the .NET Platform
cs: Vydavatel pro platformu .NET
ru: Издатель для платформы .NET
zh_hant: .NET 平台的發行者

# FrameworkOption
source: FRAMEWORK
zh_hant: 架構

# FrameworkOptionDescription
source: The target framework to publish for. The target framework has to be specified in the project file.
cs: Cílová architektura pro publikování. Cílová architektura musí být zadaná v souboru projektu.
ru: Целевая платформа публикации. Целевая платформа должна быть указана в файле проекта.
zh_hant: 要為其進行發行的目標架構。該架構必須在專案檔中指定。

# OutputOptionDescription
source: The output directory to place the published artifacts in.
cs: Výstupní adresář do kterého se mají umístit publikované artefakty
ru: Выходной каталог для размещения опубликованных артефактов.
zh_hant: 放置發行之成品的輸出目錄。

# ManifestOption
source: MANIFEST
zh_hant: 資訊清單

# ManifestOptionDescription
source: The path to a target manifest file that contains the list of packages to be excluded from the publish step.
cs: Cesta k cílovému souboru manifestu obsahujícímu seznam balíčků, které se mají vyloučit z kroku publikování
ru: Путь к целевому файлу манифеста, содержащему список пакетов, исключаемых из публикации.
zh_hant: 目標資訊清單檔案的路徑，其包含要從發行步驟中排除的套件清單。

# NoBuildOptionDescription
source: Do not build the project before publishing. Implies --no-restore.
cs: Nesestavujte projekt, dokud ho nepublikujete. Implikuje možnost --no-restore.
ru: Сборка проекта перед публикацией не выполняется. Подразумевает --no-restore.
zh_hant: 請勿在執行之前建置專案。提示：-no-restore。

# RuntimeOptionDescription
source: The target runtime to publish the application for. The default is to publish a framework-dependent application without an executable.
cs: Cílový modul runtime pro publikování aplikace. Výchozí možnost je publikovat aplikaci pro určitou architekturu bez spustitelného souboru.
ru: Целевая среда выполнения, для которой публикуется приложение. Значение по умолчанию — публикация зависимого от платформы приложения без исполняемого файла.
zh_hant: 要發佈應用程式的目標執行階段。 預設為發佈與 Framework 相依的應用程式，不含可執行檔。

# ConfigurationOptionDescription
source: The configuration to publish for. The default for most projects is 'Debug'.
cs: Konfigurace pro publikování. Výchozí možností pro většinu projektů je Debug.
ru: Конфигурация для публикации. По умолчанию для большинства проектов используется "Debug".
zh_hant: 要為其進行發行的組態。大部分的專案預設為「偵錯」。

# ModeOptionDescription
source: The mode to use when publishing the application. The 'self-contained' mode publishes the application with the .NET Core runtime. The 'fx-dependent' mode publishes the application as framework-dependent. If a target runtime is specified, it is published with an executable. The 'fx-dependent-no-exe' mode publishes the application as framework-dependent without an executable. The default is 'fx-dependent-no-exe' when a target runtime is not specified. The default is 'self-contained' when a target runtime is specified.
cs: Režim, který se použije k publikování aplikace. Režim self-contained publikuje aplikaci modulem runtime .NET Core. Režim fx-dependent publikuje aplikaci pro určitou architekturu. Pokud zadáte cílový modul runtime, publikuje se se spustitelným souborem. Režim fx-dependent-no-exe publikuje aplikaci pro určitou architekturu, ale bez spustitelného souboru. Pokud není zadaný cílový modul runtime, je výchozí možnost fx-dependent-no-exe. Pokud je zadaný cílový modul runtime, je výchozí možnost self-contained.
ru: Режим, используемый при публикации приложения. В режиме self-contained приложение публикуется со средой выполнения .NET Core. В режиме fx-dependent приложение публикуется как зависимое от платформы. Если указать целевую среду выполнения, оно публикуется с исполняемым файлом. В режиме fx-dependent-no-exe приложение публикуется как зависимое от платформы без исполняемого файла. Если целевая среда выполнения не указана, по умолчанию используется режим fx-dependent-no-exe. Если целевая среда выполнения указана, по умолчанию используется режим self-contained.
zh_hant: 發佈應用程式時要使用的模式。 'self-contained' 模式會透過 .NET Core 執行階段發佈應用程式。 'fx-dependent' 模式會發佈與 Framework 相依的應用程式。如有指定目標執行階段，則會隨可執行檔發佈。 'fx-dependent-no-exe' 模式會發佈與 Framework 相依的應用程式，不含可執行檔。 當未指定目標執行階段時，預設為 'fx-dependent-no-exe'。 當有指定目標執行階段時，預設為 'self-contained'。

# ModeOptionName
source: MODE
zh_hant: 模式

# PublishModeAndSelfContainedOptionsConflict
source: The '--mode' and '--self-contained' options cannot be used together. Specify only one of the options.
cs: Možnosti --mode a --self-contained nejdou použít společně. Zadejte jenom jednu z nich.
ru: Параметры --mode и --self-contained недопустимо использовать вместе. Укажите только один из них.
zh_hant: '--mode' 和 '--self-contained' 選項不得一併使用。請只指定其中一個選項。

# UnsupportedPublishMode
source: The specified publish mode '{0}' is not supported.
cs: Režim publikování {0}, který je zadaný, není podporovaný.
ru: Указанный режим публикации "{0}" не поддерживается.
zh_hant: 不支援指定的發佈模式 '{0}'。
