Repository: 16CentAstrology/sdk
Catalog: src/dotnet/commands/dotnet-uninstall/tool/xlf/LocalizableStrings.*.xlf
Languages: ja, ru

# PackageIdArgumentDescription
source: NuGet Package Id of the tool to uninstall.
ja: アンインストールするツールの NuGet パッケージ ID。
ru: Идентификатор пакета NuGet удаляемого инструмента.

# CommandDescription
source: Uninstalls a tool.
ja: ツールをアンインストールします。
ru: Удаляет инструмент.

# SpecifyExactlyOnePackageId
source: Please specify one tool Package Id to uninstall.
ja: アンインストールするツール パッケージの ID を 1 つ指定してください。
ru: Укажите один идентификатор пакета удаляемого инструмента.

# GlobalOptionDescription
source: Uninstall user wide.
ja: ユーザー全体でアンインストールします。
ru: Удаление на уровне пользователя.

# UninstallSucceeded
source: Tool '{0}' (version '{1}') was successfully uninstalled.
ja: ツール '{0}' (バージョン '{1}') は正常にアンインストールされました。
ru: Инструмент "{0}" (версия "{1}") удален.

# ToolNotInstalled
source: Tool '{0}' is not currently installed.
ja: ツール '{0}' は現在、インストールされていません。
ru: Инструмент "{0}" сейчас не установлен.

# ToolHasMultipleVersionsInstalled
source: Tool '{0}' has multiple versions installed and cannot be uninstalled.
ja: ツール '{0}' の複数のバージョンがインストールされており、アンインストールできません。
ru: Установлено несколько версий инструмента "{0}", и удалить его невозможно.

# FailedToUninstallTool
source: Failed to uninstall tool '{0}': {1}
ja: ツール '{0}' をアンインストールできませんでした: {1}
ru: Не удалось удалить инструмент "{0}": {1}

# UninstallToolCommandNeedGlobalOrToolPath
source: Need either global or tool-path provided.
ja: global か tool-path を指定する必要があります。
ru: Требуется указать глобальный параметр или параметр tool-path.

# ToolPathDescription
source: Location of shim to access tool
ja: ツールにアクセスする shim の場所
ru: Расположение оболочки совместимости для доступа к инструменту

# UninstallToolCommandInvalidGlobalAndToolPath
source: Cannot have global and tool-path as opinion at the same time."
ja: global と tool-path を意見として同時に指定することはできません。"
ru: Невозможно указать глобальный параметр и параметр tool-path в качестве оценки одновременно.
